app/views/calendar/index.html.erb

SELECT "events".* FROM "events" WHERE (('2016-03-26 15:00:00.000000' <= "events".end_at) AND ("events".start_at< '2016-04-30 15:00:00.000000'))  ORDER BY "events".start_at ASC
---

  $.each(dates, function(index, value){
    make_hidden('selected[]', value, 'new_event');
  });