app/controllers/calendar_controller.rb

SELECT "events".* FROM "events" WHERE (('2016-03-26 15:00:00.000000' <= "events".end_at) AND ("events".start_at< '2016-04-30 15:00:00.000000'))  ORDER BY "events".start_at ASC
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 16]]
---
  def index
    @ar = ["apple", "orange"]
    @month = (params[:month] || (Time.zone || Time).now.month).to_i
    @year = (params[:year] || (Time.zone || Time).now.year).to_i

    @shown_month = Date.civil(@year, @month)
    from = DateTime.now.at_beginning_of_day
    to = DateTime.tomorrow.at_beginning_of_day

    @today_event = Event.where(start_at: from...to).order(start_at: :desc)
    @event_strips = Event.event_strips_for_month(@shown_month)
    if params[:id] then
      @event = Event.find_by(:id => params[:id])

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 58]]
UPDATE "events" SET "name" = ?, "start_at" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["name", "teeeest"], ["start_at", "2016-05-10 01:00:00.000000"], ["updated_at", "2016-05-10 05:20:31.469180"], ["id", 81]]
---
  def update
    params.permit!
    if params[:delete_button] then
      redirect_to controller: "events", action: "delete", event: params[:event]
    else
      @old_event = Event.find_by(:id=>params[:event][:id])
      if @old_event.present?
        @old_event.update(params[:event])