app/controllers/events_controller.rb

  def create
    params.permit!
    if !params[:update_button] && !params[:delete_button] && !params[:delete_all_button] then
      @new_event = Event.new(params[:event])
      @new_event.save
---
INSERT INTO "events" ("name", "start_at", "end_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "def"], ["start_at", "2016-04-22 08:43:00.000000"], ["end_at", "2016-04-24 08:43:00.000000"], ["created_at", "2016-04-22 08:49:02.246667"], ["updated_at", "2016-04-22 08:49:02.246667"]]

  def show
    @event = Event.find_by(:id => params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 3]]

  def delete
    @event = Event.find_by(:id => params[:event][:id])
    #@event = params[:event]
    if @event.present?
      @event.destroy
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 5]]